[
  {
    "title": "Knowledge Base 2.0",
    "image": "./knowledge-base.png",
    "icon": "",
    "description": "Knowledge Base 2.0 is an advanced documentation platform that serves as a robust knowledge management system. Built with Docusaurus, the platform is designed to streamline both internal and external access to detailed, structured documentation. This version builds upon the previous iteration by introducing a more user-centric design, improved search functionality, and advanced content creation tools. Whether you're a developer, customer support agent, or end-user, this platform promises to deliver an intuitive experience with easily accessible documentation, all powered by modern web technologies.",
    "details": "Developed with a focus on scalability, maintainability, and user experience, Knowledge Base 2.0 is powered by Docusaurus, a static site generator optimized for documentation. The platform integrates seamlessly with GitHub Actions to automate deployment processes, ensuring that any updates to the content are reflected immediately in the live environment. Content creators are equipped with custom Node.js scripts that automate the deployment of new documentation pages, allowing them to focus on writing instead of worrying about the intricacies of deployment. The system leverages CI/CD pipelines to ensure that updates are tested and deployed reliably, with built-in error handling and automated versioning. Additionally, the platform is optimized for speed with advanced caching techniques, making sure that users can quickly find the information they need without waiting for content to load. A robust search functionality is backed by Elasticsearch, ensuring that the platform handles even large-scale documentation with ease. A user-friendly admin interface allows non-technical users to manage content without needing to touch code, ensuring smooth collaboration between technical writers, engineers, and other stakeholders.\n \n\n \n The development of Knowledge Base 2.0 was not just a technical challenge, but a tremendous learning experience. Close communication with stakeholders throughout the process was key to ensuring that the platform aligned with both their expectations and user needs. Regular feedback sessions and iterative design allowed us to refine the product and ensure it met high standards for usability and performance. The project provided invaluable insights into agile methodologies, as well as the importance of maintaining flexibility and adaptability in response to stakeholder needs. The hard work and dedication invested in creating this product were immensely rewarding, and it was a fantastic opportunity to apply a wide range of technical skills while working collaboratively with a talented team.",
    "link": "https://advenica.github.io",
    "modalTitle": "Knowledge Base 2.0",
    "gitHubLink": "https://github.com/Advenica/advenica.github.io",
    "alt": "Knowledge Base Logo",
    "course": "Fullstack Development",
    "tech": "Docusaurus, React, TypeScript, Node.js, GitHub Actions,",
    "date": "April 2025"
  },
  {
    "title": "Rent-A-Rat",
    "image": "./rat.png",
    "icon": "<GiSeatedMouse />",
    "description": "Rent-a-Rat is a Vue.js application for renting and renting out rats and their services, offering a dynamic user experience. It features two main layouts—Rentee and Renter—that allow users to browse, book, and manage rat rentals.",
    "details": "Features include authentication, user profiles, rat search, favorites, and editing, along with engaging UI effects like particle overlays and glowing buttons. Built with Vue 3 and Vue Router 4, the app is modular and easy to maintain, with reusable components and smooth navigation. It’s a fun and interactive platform for exploring modern web development with an imaginative concept.",
    "link": "https://github.com/TeamMalmo/RentRat/tree/dev",
    "modalTitle": "Rent-a-Rat",
    "gitHubLink": "https://github.com/TeamMalmo/RentRat/tree/dev",
    "alt": "Rat Logo",
    "course": "Vue - Group Project",
    "tech": "Vue.js, Vite, Axios, Oauth JavaScript, HTML, CSS",
    "date": "Dec 2024"
  },
  {
    "title": "Vanilla JS CV",
    "image": "./vanilla-cv.png",
    "icon": "<GiSeatedMouse />",
    "description": "This project was born out of my passion for UX right after completing my Advanced Web Development course. Enthralled by the endless possibilities of vanilla JavaScript DOM manipulation (before learning frameworks), I had an absolute blast bringing this site to life!",
    "details": "As I delved into Figma to create mock layouts and wireframes, I saw the perfect opportunity to give my resume site a creative twist. I envisioned a dynamic experience with a clear color scheme, language options, smooth animations, and interactive elements that revealed more information on click. However, as my skills grew, I realized that clarity, ease of navigation, and a streamlined user experience were just as important as aesthetics. That insight led me to develop the very React-based portfolio you're viewing now! While this vanilla JS project has since retired, it was an incredibly fun and valuable learning experience.",
    "link": "https://cv-eva-bjorling.netlify.app/",
    "modalTitle": "Vanilla JS CV",
    "gitHubLink": "https://github.com/evesteve94/CV-update",
    "alt": "Screenshot of my previous CV project",
    "course": "UX in Web Development",
    "tech": "Vanilla JavaScript, HTML, CSS & Figma",
    "date": "March 2024"
  },

  {
    "title": "King Pizza-rd and the Lizard Wizard",
    "image": "./pizza.png",
    "icon": "",
    "description": "This project is a magical and interactive website for the pizzeria King Pizzard and the Lizzard Wizzard. The site is built with Vue 3 and uses Vite as the build tool. Here, users can read the whimsical story of Pizzard, a pizza-making wizard, and explore the pizzeria's magical menu.",
    "details": "The website features a dynamic menu fetched from an external API, as well as an interactive shopping cart where users can add and remove pizzas. All cart information is saved locally in the browser's localStorage to ensure the contents persist even after page reloads. The project combines creative storytelling with functional web application features, offering an engaging user experience.",
    "link": "https://github.com/evesteve94/PizzaSite",
    "modalTitle": "King Pizza-rd and the Lizard Wizard",
    "gitHubLink": "https://github.com/evesteve94/PizzaSite",
    "alt": "Pizza Logo",
    "course": "Vue",
    "tech": "Vue.js, Vite, JavaScript, HTML, CSS",
    "date": "Dec 2024"
  },

  {
    "title": "The Journalist's Guide to Inaccuracy",
    "image": "./news-feed.png",
    "icon": "",
    "description": "The Journalist's Guide To Inaccuracy is a fun and interactive website where creativity and humor take center stage. The platform uses AI to create witty and absurd articles narrated by iconic characters like Marvin the Paranoid Android, Arthur Dent, and Zaphod Beeblebrox. Users can customize their experience by choosing topics, audiences, and narrators, while enjoying custom AI-generated images. It’s a playful exploration of storytelling where truth takes a backseat and imagination leads the way. The web app is built with modern technologies like React, TypeScript, and Node.js for a smooth user experience.",
    "details": "The platform is built with a modern tech stack to offer both speed and flexibility. The frontend is developed with React and TypeScript, providing a dynamic and typed user experience, while Vite is used for fast development and build processes. React Router is employed for seamless navigation between pages, and API calls are managed by Axios. The backend is built with Node.js and Express.js, with Prisma used as an ORM for managing the PostgreSQL database. Articles and images are generated using OpenAI and an AI SDK, while images are stored and retrieved via Cloudinary. File uploads are handled by Multer, ensuring users have a smooth experience throughout the application.",
    "link": "https://github.com/evesteve94/journalists-guide-to-inaccuracy/tree/main",
    "modalTitle": "The Journalist's Guide to Inaccuracy",
    "gitHubLink": "https://github.com/evesteve94/journalists-guide-to-inaccuracy/tree/main",
    "alt": "Website Logo",
    "course": "AI in Web Development",
    "tech": "Node.js, Express, React, TypeScript, Prisma, Multer, Cloudinary, OpenAI",
    "date": "Nov 2024"
  },
  {
    "title": "Wedding Site",
    "image": "./wedding2.png",
    "icon": "",
    "description": "This website is by far my favourite side project to date. It is a wedding gift for my brother, implementing his to-be-wife's illustrations. It is my biggest React project, with pleanty of custom-made components and seemless dropdown menus. Additionally, I have implemented login, authenication and a database through Firebase db. Users can log in, write, edit and delete messages in the guest book and view pictures from the wedding. ",
    "details": "This is my pride and joy! It was a fantastic experince to create the entire site from scratch and using all the skills I have learned during my first term at Chas Academy. For the first time I created a real fullstack project, though frontend-heavy, it uses CRUD-operations to communicate with the database and doesn't only rely on LocalStorage. Additionally, I used a group of friends as a test group for feedback before launching it to the weddings 160 guests.",
    "link": "https://viktor-emma-08juni2024.netlify.app/",
    "modalTitle": "Wedding Site",
    "gitHubLink": "https://github.com/evesteve94/wedding",
    "alt": "Orange Jellyfish Logo",
    "course": "Side Project",
    "tech": "React, JavaScript, Firebase DB, HTML, CSS",
    "date": "May 2024"
  },
  {
    "title": "Dashboard",
    "image": "./dash.png",
    "icon": "",
    "description": "An assignment for my Advanced Frontend Dev course, coded 100% vanilla. Weather forecasts are updated in realtime from OpenWeatherAPI, the layout is editable by the user with custom backgrounds fetched from an Unplash API. The title, quick links and notepad content are interactive and saved to the browsers localStorage.",
    "details": "The interface is clean and user-friendly, providing essential functionalities like timekeeping, note-taking, and access to frequently visited websites. With completed scripts handling each feature, the dashboard offers a comprehensive and customizable experience for users to enhance their productivity and enjoyment of daily tasks.",
    "link": "https://dashboard-evesteve-open-access.netlify.app/",
    "modalTitle": "Dashboard",
    "gitHubLink": "https://github.com/evesteve94/dashboard-open-access",
    "alt": "Orange Dashboard Logo",
    "course": "Advanced Frontend Development",
    "tech": "JavaScript, HTML, CSS",
    "date": "December 2023"
  },
  {
    "title": "TicTacToe",
    "image": "./tic.png",
    "icon": "",
    "description": "An assignment for my React course, coded in React and TypeScript to learn how to type props, states and functions when passed through components. The User can choose between three different boards and adjust the length of the winning combonation before starting the game.",
    "details": "Tic Tac Toe is a simple web application that allows users to play the classic Tic Tac Toe game. It's built using React.js, a popular JavaScript library for building user interfaces. Automatic Win Detection: The app automatically detects when a player has won the game or if it's a draw. Restart Game: Players can restart the game at any time to play again.",
    "link": "https://tic-tac-toe-evesteve.netlify.app/",
    "modalTitle": "Tic Tac Toe",
    "gitHubLink": "https://github.com/evesteve94/tic-tac-toe?tab=readme-ov-file",
    "alt": "Orange Tic Tac Toe Logo",
    "course": "React",
    "tech": "React, TypeScript, HTML, CSS",
    "date": "April 2024"
  },
  {
    "title": "Loan Crunch",
    "image": "./morgage.png",
    "icon": "",
    "description": "Small project coded 100% vanilla TypeScript. The user can calculate their morgage by entering loan amount, interest rate and loan period and then view a payment plan month-by-month.",
    "details": "This application is a straightforward loan calculator allowing users to input the loan amount, interest rate, and loan period to estimate monthly payments and total interest. It validates input values and provides a detailed payment plan showing monthly payment amounts, interest paid, and remaining balance over the loan term. If input values exceed realistic thresholds, it displays warnings.",
    "link": "https://morgage-calculator-evesteve.netlify.app/",
    "modalTitle": "Loan Crunch",
    "gitHubLink": "https://github.com/evesteve94/morgage-calculator",
    "alt": "Orange House Logo",
    "course": "TypeScript Intro",
    "tech": "TypeScript, HTML, CSS",
    "date": "January 2024"
  },
  {
    "title": "Quire",
    "image": "./quire.png",
    "icon": "",
    "description": "As part of an Agile Working Methods course, my team and I developed an online text editor. I was responisible for most of the functionality, particulary the dynamicSave() function and updating the saved notes to localStorage. Through this project I learned how to work remotely with a group, merge and solve conflicts in git and GitHub, and develope larger programs with TypeScript, all in vanilla!",
    "details": "With a user-friendly interface, it offers a range of functionalities, including a navigation bar for quick access to essential features like note search, viewing all notes, accessing favorites, and analytics. The main output container dynamically displays notes based on user interactions, while the floating control menu provides convenient buttons for creating new notes, printing, and marking as favorites. Users can create notes with titles and text areas, save or delete them as needed, and utilize the search function to find specific notes. Quire also integrates Google Analytics for tracking website usage. ",
    "link": "https://quireteammalmo.netlify.app/",
    "modalTitle": "Quire",
    "gitHubLink": "https://github.com/carstern/quireproject",
    "alt": "Orange Notebook Logo",
    "course": "Advanced Frontend Development",
    "tech": "TypeScript, HTML, CSS",
    "date": "February 2024"
  },
  {
    "title": "Rent-A-Rat",
    "image": "./rat.png",
    "icon": "<GiSeatedMouse />",
    "description": "Rent-a-Rat is a Vue.js application for renting and renting out rats and their services, offering a dynamic user experience. It features two main layouts—Rentee and Renter—that allow users to browse, book, and manage rat rentals.",
    "details": "Features include authentication, user profiles, rat search, favorites, and editing, along with engaging UI effects like particle overlays and glowing buttons. Built with Vue 3 and Vue Router 4, the app is modular and easy to maintain, with reusable components and smooth navigation. It’s a fun and interactive platform for exploring modern web development with an imaginative concept.",
    "link": "https://github.com/TeamMalmo/RentRat/tree/dev",
    "modalTitle": "Rent-a-Rat",
    "gitHubLink": "https://github.com/TeamMalmo/RentRat/tree/dev",
    "alt": "Rat Logo",
    "course": "Vue - Group Project",
    "tech": "Vue.js, Vite, Axios, Oauth JavaScript, HTML, CSS",
    "date": "Dec 2024"
  },
  {
    "title": "Vanilla JS CV",
    "image": "./vanilla-cv.png",
    "icon": "<GiSeatedMouse />",
    "description": "This project was born out of my passion for UX right after completing my Advanced Web Development course. Enthralled by the endless possibilities of vanilla JavaScript DOM manipulation (before learning frameworks), I had an absolute blast bringing this site to life!",
    "details": "As I delved into Figma to create mock layouts and wireframes, I saw the perfect opportunity to give my resume site a creative twist. I envisioned a dynamic experience with a clear color scheme, language options, smooth animations, and interactive elements that revealed more information on click. However, as my skills grew, I realized that clarity, ease of navigation, and a streamlined user experience were just as important as aesthetics. That insight led me to develop the very React-based portfolio you're viewing now! While this vanilla JS project has since retired, it was an incredibly fun and valuable learning experience.",
    "link": "https://cv-eva-bjorling.netlify.app/",
    "modalTitle": "Vanilla JS CV",
    "gitHubLink": "https://github.com/evesteve94/CV-update",
    "alt": "Screenshot of my previous CV project",
    "course": "UX in Web Development",
    "tech": "Vanilla JavaScript, HTML, CSS & Figma",
    "date": "March 2024"
  },

  {
    "title": "King Pizza-rd and the Lizard Wizard",
    "image": "./pizza.png",
    "icon": "",
    "description": "This project is a magical and interactive website for the pizzeria King Pizzard and the Lizzard Wizzard. The site is built with Vue 3 and uses Vite as the build tool. Here, users can read the whimsical story of Pizzard, a pizza-making wizard, and explore the pizzeria's magical menu.",
    "details": "The website features a dynamic menu fetched from an external API, as well as an interactive shopping cart where users can add and remove pizzas. All cart information is saved locally in the browser's localStorage to ensure the contents persist even after page reloads. The project combines creative storytelling with functional web application features, offering an engaging user experience.",
    "link": "https://github.com/evesteve94/PizzaSite",
    "modalTitle": "King Pizza-rd and the Lizard Wizard",
    "gitHubLink": "https://github.com/evesteve94/PizzaSite",
    "alt": "Pizza Logo",
    "course": "Vue",
    "tech": "Vue.js, Vite, JavaScript, HTML, CSS",
    "date": "Dec 2024"
  },

  {
    "title": "The Journalist's Guide to Inaccuracy",
    "image": "./news-feed.png",
    "icon": "",
    "description": "The Journalist's Guide To Inaccuracy is a fun and interactive website where creativity and humor take center stage. The platform uses AI to create witty and absurd articles narrated by iconic characters like Marvin the Paranoid Android, Arthur Dent, and Zaphod Beeblebrox. Users can customize their experience by choosing topics, audiences, and narrators, while enjoying custom AI-generated images. It’s a playful exploration of storytelling where truth takes a backseat and imagination leads the way. The web app is built with modern technologies like React, TypeScript, and Node.js for a smooth user experience.",
    "details": "The platform is built with a modern tech stack to offer both speed and flexibility. The frontend is developed with React and TypeScript, providing a dynamic and typed user experience, while Vite is used for fast development and build processes. React Router is employed for seamless navigation between pages, and API calls are managed by Axios. The backend is built with Node.js and Express.js, with Prisma used as an ORM for managing the PostgreSQL database. Articles and images are generated using OpenAI and an AI SDK, while images are stored and retrieved via Cloudinary. File uploads are handled by Multer, ensuring users have a smooth experience throughout the application.",
    "link": "https://github.com/evesteve94/journalists-guide-to-inaccuracy/tree/main",
    "modalTitle": "The Journalist's Guide to Inaccuracy",
    "gitHubLink": "https://github.com/evesteve94/journalists-guide-to-inaccuracy/tree/main",
    "alt": "Website Logo",
    "course": "AI in Web Development",
    "tech": "Node.js, Express, React, TypeScript, Prisma, Multer, Cloudinary, OpenAI",
    "date": "Nov 2024"
  },
  {
    "title": "Wedding Site",
    "image": "./wedding2.png",
    "icon": "",
    "description": "This website is by far my favourite side project to date. It is a wedding gift for my brother, implementing his to-be-wife's illustrations. It is my biggest React project, with pleanty of custom-made components and seemless dropdown menus. Additionally, I have implemented login, authenication and a database through Firebase db. Users can log in, write, edit and delete messages in the guest book and view pictures from the wedding. ",
    "details": "This is my pride and joy! It was a fantastic experince to create the entire site from scratch and using all the skills I have learned during my first term at Chas Academy. For the first time I created a real fullstack project, though frontend-heavy, it uses CRUD-operations to communicate with the database and doesn't only rely on LocalStorage. Additionally, I used a group of friends as a test group for feedback before launching it to the weddings 160 guests.",
    "link": "https://viktor-emma-08juni2024.netlify.app/",
    "modalTitle": "Wedding Site",
    "gitHubLink": "https://github.com/evesteve94/wedding",
    "alt": "Orange Jellyfish Logo",
    "course": "Side Project",
    "tech": "React, JavaScript, Firebase DB, HTML, CSS",
    "date": "May 2024"
  },
  {
    "title": "Dashboard",
    "image": "./dash.png",
    "icon": "",
    "description": "An assignment for my Advanced Frontend Dev course, coded 100% vanilla. Weather forecasts are updated in realtime from OpenWeatherAPI, the layout is editable by the user with custom backgrounds fetched from an Unplash API. The title, quick links and notepad content are interactive and saved to the browsers localStorage.",
    "details": "The interface is clean and user-friendly, providing essential functionalities like timekeeping, note-taking, and access to frequently visited websites. With completed scripts handling each feature, the dashboard offers a comprehensive and customizable experience for users to enhance their productivity and enjoyment of daily tasks.",
    "link": "https://dashboard-evesteve-open-access.netlify.app/",
    "modalTitle": "Dashboard",
    "gitHubLink": "https://github.com/evesteve94/dashboard-open-access",
    "alt": "Orange Dashboard Logo",
    "course": "Advanced Frontend Development",
    "tech": "JavaScript, HTML, CSS",
    "date": "December 2023"
  },
  {
    "title": "TicTacToe",
    "image": "./tic.png",
    "icon": "",
    "description": "An assignment for my React course, coded in React and TypeScript to learn how to type props, states and functions when passed through components. The User can choose between three different boards and adjust the length of the winning combonation before starting the game.",
    "details": "Tic Tac Toe is a simple web application that allows users to play the classic Tic Tac Toe game. It's built using React.js, a popular JavaScript library for building user interfaces. Automatic Win Detection: The app automatically detects when a player has won the game or if it's a draw. Restart Game: Players can restart the game at any time to play again.",
    "link": "https://tic-tac-toe-evesteve.netlify.app/",
    "modalTitle": "Tic Tac Toe",
    "gitHubLink": "https://github.com/evesteve94/tic-tac-toe?tab=readme-ov-file",
    "alt": "Orange Tic Tac Toe Logo",
    "course": "React",
    "tech": "React, TypeScript, HTML, CSS",
    "date": "April 2024"
  },
  {
    "title": "Loan Crunch",
    "image": "./morgage.png",
    "icon": "",
    "description": "Small project coded 100% vanilla TypeScript. The user can calculate their morgage by entering loan amount, interest rate and loan period and then view a payment plan month-by-month.",
    "details": "This application is a straightforward loan calculator allowing users to input the loan amount, interest rate, and loan period to estimate monthly payments and total interest. It validates input values and provides a detailed payment plan showing monthly payment amounts, interest paid, and remaining balance over the loan term. If input values exceed realistic thresholds, it displays warnings.",
    "link": "https://morgage-calculator-evesteve.netlify.app/",
    "modalTitle": "Loan Crunch",
    "gitHubLink": "https://github.com/evesteve94/morgage-calculator",
    "alt": "Orange House Logo",
    "course": "TypeScript Intro",
    "tech": "TypeScript, HTML, CSS",
    "date": "January 2024"
  },
  {
    "title": "Quire",
    "image": "./quire.png",
    "icon": "",
    "description": "As part of an Agile Working Methods course, my team and I developed an online text editor. I was responisible for most of the functionality, particulary the dynamicSave() function and updating the saved notes to localStorage. Through this project I learned how to work remotely with a group, merge and solve conflicts in git and GitHub, and develope larger programs with TypeScript, all in vanilla!",
    "details": "With a user-friendly interface, it offers a range of functionalities, including a navigation bar for quick access to essential features like note search, viewing all notes, accessing favorites, and analytics. The main output container dynamically displays notes based on user interactions, while the floating control menu provides convenient buttons for creating new notes, printing, and marking as favorites. Users can create notes with titles and text areas, save or delete them as needed, and utilize the search function to find specific notes. Quire also integrates Google Analytics for tracking website usage. ",
    "link": "https://quireteammalmo.netlify.app/",
    "modalTitle": "Quire",
    "gitHubLink": "https://github.com/carstern/quireproject",
    "alt": "Orange Notebook Logo",
    "course": "Advanced Frontend Development",
    "tech": "TypeScript, HTML, CSS",
    "date": "February 2024"
  }
]
