[
  {
    "company": "Advenica",
    "image": "./advenica.png",
    "work": "LIA Intern",
    "time": "2025 - 2025",
    "description": "At Advenica in Malmö, I am excited to apply my web development skills in a dynamic and innovative environment. Working on the web-based documentation application for Cross Domain Solutions, I collaborate with a dedicated team to create clear, user-friendly materials. This experience allows me to grow, contribute, and continuously improve—embracing new challenges with enthusiasm and a problem-solving mindset.",
    "alt": "Orange Advenica Logo"
  },
  {
    "company": "Sandvik",
    "image": "./sandvik.png",
    "work": "Forklift Driver",
    "time": "2019 - 2023",
    "description": "For four years, I was part of a hardworking team at Sandvik’s warehouse in Svedala, where efficiency and collaboration were key. I thrived in a fast-paced environment, balancing physical and administrative tasks while contributing to the company's SAP transition. Supporting and training colleagues reinforced my belief in the power of teamwork and shared knowledge.",
    "alt": "Orange Sandvik Logo"
  },
  {
    "company": "European Integration Group",
    "image": "./eig.png",
    "work": "Project Manager/Intern",
    "time": "2021 - 2022",
    "description": "As a Project Manager Intern at European Integration Group in Istanbul, I had the privilege of leading three youth exchange programs. Organizing activities, managing logistics, and ensuring seamless communication for over 120 participants taught me the importance of responsibility, adaptability, and creating meaningful connections. Bringing people together for shared learning experiences was truly rewarding.",
    "alt": "Orange EIG Logo"
  },
  {
    "company": "Malmö University",
    "image": "./malmo.png",
    "work": "Research Assistant",
    "time": "2020 - 2021",
    "description": "Supporting two PhD students in their research at Malmö University gave me hands-on experience in transcribing and translating studies on Ethnic Relations and Social Science. This role deepened my curiosity for research, strengthened my analytical skills, and reinforced my passion for lifelong learning and knowledge-sharing.",
    "alt": "Orange Malmo University Logo"
  },
  {
    "company": "Amberscript",
    "image": "./amberscript.png",
    "work": "Transcriber",
    "time": "2020 - 2021",
    "description": "Working as a freelance transcriber at Amberscript taught me precision, efficiency, and the value of meeting deadlines. Using AI-driven tools, I refined my ability to balance multiple responsibilities, prioritize tasks effectively, and maintain quality—all while managing a dynamic workload alongside my studies and other jobs.",
    "alt": "Orange AmberScript Logo"
  },
  {
    "company": "Alfa Laval",
    "image": "./alfa.png",
    "work": "Warehouse Worker",
    "time": "2018 - 2019",
    "description": "At Alfa Laval, I embraced the challenge of working alternating shifts while ensuring smooth warehouse operations. Picking and packing materials for heat exchangers required attention to detail, teamwork, and efficiency. I took pride in maintaining a well-organized workspace and supporting new colleagues through training and mentorship.",
    "alt": "Orange Alfa Laval Logo"
  },
  {
    "company": "Bidfood",
    "image": "./bid.png",
    "work": "Warehouse Manager",
    "time": "2017 - 2018",
    "description": "Managing the chilled warehouse at Bidfood was a rewarding experience that strengthened my leadership and organizational skills. Implementing efficient work routines, ensuring quality control, and mentoring new team members reinforced my belief in the power of responsibility and continuous improvement.",
    "alt": "Orange Bidfood Logo"
  },
  {
    "company": "Ikea",
    "image": "./ikea.png",
    "work": "Logistics Team Member",
    "time": "2016 - 2017",
    "description": "Being part of the logistics team at IKEA in Melbourne was an inspiring experience. Together, we worked efficiently to stock and replenish the store before opening hours. The role required teamwork, problem-solving, and adaptability—qualities that continue to shape my approach to every challenge I take on.",
    "alt": "Orange IKEA Logo"
  }
]
